

# # 1 Задача про кубики 1 кубик 60 бросков


# import numpy as np
# np.random.seed(1)
# n = 60
# b = np.random.randint(1, 7, n)
# print(b)
# # [6 4 5 1 2 4 6 1 1 2 5 6 5 2 3 5 6 3 5 4 5 3 5 6 3 5 2 2 1 6 2 2 6 2 2 1 5
# #  2 1 1 6 4 3 2 1 4 6 2 2 4 5 1 2 4 5 3 5 1 6 4]
# print()
# a = b[b == 3]
# print(a)
# # [3 3 3 3 3 3]
# print()
# m = len(a)
# print(m)
# print()
# # Теперь можем вычислить относительную частоту события А

# W = m/n
# print(W)


# #2 Смоделируем ситуацию, когда бросают 2 игральные кости одновременно 360 раз.
# #Посчитаем относительную частоту события, когда на одной кости выпадает 1, а на другой 2
# import numpy as np
# n = 360 #Количество попыток
# np.random.seed(1)
# c = np.random.randint(1, 7, size=n)
# d = np.random.randint(1, 7, size=n)
# print(c)
# # [6 4 5 1 2 4 6 1 1 2 5 6 5 2 3 5 6 3 5 4 5 3 5 6 3 5 2 2 1 6 2 2 6 2 2 1 5
# #  2 1 1 6 4 3 2 1 4 6 2 2 4 5 1 2 4 5 3 5 1 6 4 2 3 1 5 2 3 3 2 1 2 4 6 5 4
# #  6 2 4 1 1 3 3 2 4 5 3 1 1 2 2 6 4 1 1 6 6 5 6 3 5 4 6 4 6 1 4 5 4 5 5 6 5
# #  2 1 5 3 1 6 3 5 2 2 1 3 5 5 1 5 2 5 2 1 3 4 2 3 5 5 3 3 1 2 3 3 1 6 2 3 5
# #  1 6 6 2 3 2 6 5 3 1 6 1 2 6 1 2 4 2 2 6 5 5 4 6 1 4 1 4 2 3 6 6 5 6 1 6 1
# #  6 4 2 2 6 1 6 1 5 3 6 4 5 3 1 6 4 4 6 6 2 3 5 4 1 1 6 5 3 5 3 1 6 4 1 1 5
# #  6 3 2 1 5 4 1 2 3 5 5 4 4 4 4 3 4 4 6 5 4 3 5 5 1 4 4 1 4 6 6 2 1 3 3 3 1
# #  3 2 5 1 5 5 2 4 2 5 2 3 6 2 1 1 3 5 2 1 1 4 2 1 5 4 3 4 5 6 5 4 1 1 1 5 6
# #  2 6 5 2 3 6 3 6 5 6 4 5 5 1 4 3 5 6 4 5 3 4 1 6 6 3 2 4 3 1 6 2 5 2 4 4 2
# #  3 1 3 5 1 3 5 4 5 4 1 6 6 5 3 3 5 2 3 6 2 2 2 1 6 6 5]
# print()
# print(d)
# # [5 3 3 4 2 5 1 1 4 3 5 2 4 2 2 3 6 6 5 6 1 4 1 5 3 4 6 2 2 5 5 1 3 2 4 1 2
# #  1 6 3 3 5 4 3 3 3 1 6 3 1 5 6 2 6 1 3 4 1 5 4 4 4 1 4 2 3 1 2 5 3 4 5 6 5
# #  3 2 3 6 1 6 4 6 4 3 1 1 1 1 3 5 1 5 2 3 2 3 5 2 4 6 2 6 2 3 5 2 1 3 6 2 3
# #  1 1 6 4 5 2 6 1 5 1 4 3 5 4 3 5 3 5 1 1 6 5 3 3 5 3 4 6 1 1 5 4 5 4 4 5 1
# #  6 4 6 2 5 5 4 3 3 3 3 3 1 3 2 6 3 4 6 1 1 6 6 6 2 2 4 4 6 4 2 4 4 4 2 4 1
# #  5 6 1 6 6 3 5 5 3 1 4 6 3 5 6 1 5 6 3 4 5 3 5 2 4 5 4 1 4 1 5 4 1 6 4 2 5
# #  5 6 3 6 6 3 5 3 2 3 4 2 6 6 4 4 1 5 4 4 6 4 4 1 3 4 6 2 6 4 3 6 4 3 6 3 1
# #  5 1 2 4 1 1 1 2 3 5 5 3 1 2 1 1 6 3 6 5 4 1 3 2 4 4 2 5 5 5 6 1 2 1 2 3 3
# #  5 6 6 3 5 6 1 6 3 6 5 5 2 2 2 2 6 5 6 4 5 2 2 6 2 3 5 4 3 4 4 3 4 1 3 1 2
# #  6 1 6 1 4 5 1 1 6 1 1 2 1 6 2 4 4 5 6 1 2 6 1 4 3 2 2]

# a = c[(c == 1) & (d == 2)]
# print(a)  # [1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1]
# print()
# m = len(a)

# print(m)  # 12
# print()
# W = m/n
# print(W)  # 0.03333333333333333
# print()




#Применение функции  permutations
from itertools import *

for i in permutations('a''b''c''d'):

    print(i, end=' ') # abc acb bac bca cab cba
print()
for i in permutations('abb'):
    print(i, end=' ') # abb abb bab bba bab bba 
print() 
    
for i in permutations('ab', 2):
    print(i, end=' ') # ab ac ba bc ca cb 
    
    

